<a href="https://colab.research.google.com/github/Ar-Anik/Machine_Learning/blob/main/Decision_Tree_Part_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas

data = pandas.read_csv('Salary.csv')

data

       Company                  Job     Degree  Salary_More_Then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [ ]:
# Label Encoding

from sklearn.preprocessing import LabelEncoder

le_Company = LabelEncoder()
le_Job = LabelEncoder()
le_Degree = LabelEncoder()

In [ ]:
data['Company_Encoding'] = le_Company.fit_transform(data['Company'])

data['Job_Encoding'] = le_Job.fit_transform(data['Job'])

data['Degree_Encoding'] = le_Degree.fit_transform(data['Degree'])

In [ ]:
data

       Company                  Job  ... Job_Encoding  Degree_Encoding
0       google      sales executive  ...            2                0
1       google      sales executive  ...            2                1
2       google     business manager  ...            0                0
3       google     business manager  ...            0                1
4       google  computer programmer  ...            1                0
5       google  computer programmer  ...            1                1
6   abc pharma      sales executive  ...            2                1
7   abc pharma  computer programmer  ...            1                0
8   abc pharma     business manager  ...            0                0
9   abc pharma     business manager  ...            0                1
10    facebook      sales executive  ...            2                0
11    facebook      sales executive  ...            2                1
12    facebook     business manager  ...            0                0
13    facebook     business manager  ...            0                1
14    facebook  computer programmer  ...            1                0
15    facebook  computer programmer  ...            1                1

[16 rows x 7 columns]

In [ ]:
# drop column

data = data.drop(['Company', 'Job', 'Degree'], axis='columns')

data

    Salary_More_Then_100k  Company_Encoding  Job_Encoding  Degree_Encoding
0                       0                 2             2                0
1                       0                 2             2                1
2                       1                 2             0                0
3                       1                 2             0                1
4                       0                 2             1                0
5                       1                 2             1                1
6                       0                 0             2                1
7                       0                 0             1                0
8                       0                 0             0                0
9                       1                 0             0                1
10                      1                 1             2                0
11                      1                 1             2                1
12                      1                 1             0                0
13                      1                 1             0                1
14                      1                 1             1                0
15                      1                 1             1                1

In [ ]:
# split data

from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(data[['Company_Encoding', 'Job_Encoding', 'Degree_Encoding']], data[['Salary_More_Then_100k']], test_size=0.2)

In [ ]:
x_train

    Company_Encoding  Job_Encoding  Degree_Encoding
13                 1             0                1
10                 1             2                0
0                  2             2                0
9                  0             0                1
3                  2             0                1
14                 1             1                0
5                  2             1                1
15                 1             1                1
2                  2             0                0
7                  0             1                0
11                 1             2                1
1                  2             2                1

In [ ]:
y_train

    Salary_More_Then_100k
13                      1
10                      1
0                       0
9                       1
3                       1
14                      1
5                       1
15                      1
2                       1
7                       0
11                      1
1                       0

In [ ]:
x_test

    Company_Encoding  Job_Encoding  Degree_Encoding
4                  2             1                0
8                  0             0                0
12                 1             0                0
6                  0             2                1

In [ ]:
y_test

    Salary_More_Then_100k
4                       0
8                       0
12                      1
6                       0

In [ ]:
# create Tree Model

from sklearn.tree import DecisionTreeClassifier

model = DecisionTreeClassifier()

In [ ]:
# Train Model

model.fit(x_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
# model score

model.score(x_test, y_test)

0.5

In [35]:
# Company Encoding Value
# abc pharma = 0, facebook = 1, google = 2

# Job Encoding
# business manager = 0, computer programmer = 1, sales executive = 2

# Degree Encoding
# bachelors	 = 0, masters	= 1

# predict value
model.predict([[1, 0, 1]])

array([1])

In [36]:
model.predict([[0, 2, 0]])

array([0])

In [38]:
model.predict([[2, 1, 0]])   # Here We found wrong prediction

array([1])